DataProcessors/ИнтерфейсВводаПолейЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИнтерфейсВводаПолейЭМД</Name>
			<Comment>Для избранных полей особые формы ввода</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ChartsOfCharacteristicTypes/ПараметрыHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ПараметрыHTML</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.СтрокиЭМКНеограниченнойДлины</v8:Type>
				<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
				<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
				<v8:Type>cfg:CatalogRef.РеестрМедицинскихОрганизаций</v8:Type>
				<v8:Type>cfg:DocumentRef.Прием</v8:Type>
				<v8:Type>cfg:CatalogRef.ИнструментальныеИсследования</v8:Type>
				<v8:Type>cfg:CatalogRef.ДействующиеВеществаЛекарственныхПрепаратов</v8:Type>
				<v8:Type>cfg:CatalogRef.НоменклатураМедицинскихУслуг</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
				<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
				<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
				<v8:Type>cfg:DocumentRef.ДоговорСКлиентом</v8:Type>
				<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
				<v8:Type>cfg:EnumRef.ВидыСтационара</v8:Type>
				<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
				<v8:Type>cfg:CatalogRef.ДополнительныеЗначенияХарактеристик</v8:Type>
				<v8:Type>cfg:CatalogRef.ЛабораторныеТесты</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.МедицинскоеОборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыМедицинскихДокументов</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
				<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>18</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВычисляемыеЗначенияПараметров</v8:Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.РеестрМедицинскихОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнструментальныеИсследования</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураМедицинскихУслуг</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеЗначенияХарактеристик</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛабораторныеТесты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.МедицинскоеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВычисляемоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаполняетсяПредыдущимиЗначениями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноДляЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяПрофпатологом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРедактируетсяПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматнаяСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерсональныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыборПоСсылкеИзОграниченногоСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводВручнуюПриВыбореИзОграниченногоСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКлассификаторовМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьГотовымиФразамиВыборИзОграниченногоСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляВрача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодировкаПолейЭМД</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяДляВводаДругихПараметров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_МногострочныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПакетыСоставныхФраз</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пакет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПакетыСоставныхФраз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияВыбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючРодителя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнструментальныеИсследования</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыМедицинскихДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

DataProcessors/ИнтерфейсВводаПолейЭМД/Forms/АртериальноеДавление/Ext/Form/Module.bsl
// Описание особенности применения.

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыСТребуемымТипом();
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Результат = Новый Соответствие;
	
	Для Каждого Эл Из ПараметрыВерхнее Цикл
		Результат.Вставить(Эл, Верхнее);
	КонецЦикла; 
	
	Для Каждого Эл Из ПараметрыНижнее Цикл
		Результат.Вставить(Эл, Нижнее);
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыСТребуемымТипом()
	
	Запрос = Новый Запрос;
	
	ВитальныеПараметрыВидКлассификатора = Перечисления.ВидыКлассификаторовМинЗдрава.ВитальныеПараметры;
	Запрос.УстановитьПараметр("Верхнее", ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(3, ВитальныеПараметрыВидКлассификатора));
	Запрос.УстановитьПараметр("Нижнее",	 ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(2, ВитальныеПараметрыВидКлассификатора));
	
	ПараметрыШаблона = Новый Массив();
	ПараметрыШаблона.Добавить(Параметры.РедактируемыйПараметрШаблона);
	Если Параметры.Свойство("СвязанныеПараметрыШаблона") Тогда
		Для Каждого кзПараметр Из Параметры.СвязанныеПараметрыШаблона Цикл
			ПараметрыШаблона.Добавить(кзПараметр.Ключ);
		КонецЦикла;
	КонецЕсли;
	Запрос.УстановитьПараметр("ИспользоватьОтбор", ЗначениеЗаполнено(ПараметрыШаблона)); 
	Запрос.УстановитьПараметр("ПараметрыШаблона", ПараметрыШаблона);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыHTML.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ПараметрыHTML.Назначение = &Нижнее
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Нижнее
	|ИЗ
	|	ПланВидовХарактеристик.ПараметрыHTML КАК ПараметрыHTML
	|ГДЕ
	|	(ПараметрыHTML.Назначение = &Верхнее
	|			ИЛИ ПараметрыHTML.Назначение = &Нижнее)
	|	И (НЕ &ИспользоватьОтбор
	|			ИЛИ ПараметрыHTML.Ссылка В (&ПараметрыШаблона))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мВерхнее = Новый Массив;
	мНижнее = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Нижнее Тогда
			мНижнее.Добавить(Выборка.Ссылка);
		Иначе
			мВерхнее.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыВерхнее = Новый ФиксированныйМассив(мВерхнее);
	ПараметрыНижнее = Новый ФиксированныйМассив(мНижнее);
	
	Элементы.Верхнее.Видимость = мВерхнее.Количество() <> 0;
	Элементы.Нижнее.Видимость = мНижнее.Количество() <> 0;
	
	// Начальное заполнение.
	ПоляФормы = Новый Структура("Верхнее, Нижнее", мВерхнее, мНижнее);
	Для Каждого кзПолеФормы Из ПоляФормы Цикл
		
		НачальноеЗначение = Неопределено;
		
		Для Каждого ПараметрШаблона Из кзПолеФормы.Значение Цикл
			
			// Приоритет поля, по которому нажал пользователь
			Если ПараметрШаблона = Параметры.РедактируемыйПараметрШаблона Тогда
				НачальноеЗначение = Параметры.НачальноеЗначение;
				Прервать;
			ИначеЕсли Параметры.Свойство("СвязанныеПараметрыШаблона") Тогда
				Для Каждого кзПараметр Из Параметры.СвязанныеПараметрыШаблона Цикл
					Если ПараметрШаблона = кзПараметр.Ключ Тогда
						НачальноеЗначение = кзПараметр.Значение;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ЗначениеЗаполнено(НачальноеЗначение) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЭтотОбъект[кзПолеФормы.Ключ] = НачальноеЗначение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
